app/controllers/clasificacions_controller.rb

SELECT `clasificacions`.* FROM `clasificacions`
---
  def index
    @clasificacions = Clasificacion.all

INSERT INTO `clasificacions` (`comentario`, `created_at`, `edadMax`, `edadMin`, `nombre`, `updated_at`) VALUES ('Obra para no menores de 15', '2015-04-26 01:09:03', 30, 15, 'A', '2015-04-26 01:09:03')
---
  def create
    @clasificacion = Clasificacion.new(clasificacion_params)

    respond_to do |format|
      if @clasificacion.save

UPDATE `clasificacions` SET `comentario` = 'Esta categoria es para niños mayores de 14 años acompañados por sus padres.', `edadMin` = 14, `nombre` = 'PG-14', `updated_at` = '2015-04-28 00:52:45' WHERE `clasificacions`.`id` = 5
---
  def update
    respond_to do |format|
      if @clasificacion.update(clasificacion_params)

DELETE FROM `clasificacions` WHERE `clasificacions`.`id` = 1
---
  def destroy
    @clasificacion.destroy

SELECT  `clasificacions`.* FROM `clasificacions`  WHERE `clasificacions`.`id` = 2 LIMIT 1
---
    def set_clasificacion
      @clasificacion = Clasificacion.find(params[:id])