app/controllers/destrezas_controller.rb

  def index
    @destrezas = Destreza.all
---
SELECT `destrezas`.* FROM `destrezas`

  def create
    @destreza = Destreza.new(destreza_params)

    respond_to do |format|
      if @destreza.save
---
INSERT INTO `destrezas` (`comentario`, `created_at`, `nombre`, `updated_at`) VALUES ('cdagsh', '2015-05-01 17:22:22', 'hola', '2015-05-01 17:22:22')

    def set_destreza
      @destreza = Destreza.find(params[:id])
---
SELECT  `destrezas`.* FROM `destrezas`  WHERE `destrezas`.`id` = 1 LIMIT 1