app/controllers/funcions_controller.rb

SELECT `funcions`.* FROM `funcions`
---
  def index
    @funcions = Funcion.all

INSERT INTO `funcions` (`comentario`, `created_at`, `hora`, `updated_at`) VALUES ('cvxbhvx', '2015-05-01 23:43:22', '2015-05-01 06:28:00', '2015-05-01 23:43:22')
---
  def create
    @funcion = Funcion.new(funcion_params)

    respond_to do |format|
      if @funcion.save

UPDATE `funcions` SET `comentario` = 'asdhgyhu', `updated_at` = '2015-05-02 16:44:26' WHERE `funcions`.`id` = 1
---
  def update
    respond_to do |format|
      if @funcion.update(funcion_params)

SELECT  `funcions`.* FROM `funcions`  WHERE `funcions`.`id` = 1 LIMIT 1
---
    def set_funcion
      @funcion = Funcion.find(params[:id])