app/controllers/generos_controller.rb

SELECT `generos`.* FROM `generos`
---
  def index
    @generos = Genero.all

INSERT INTO `generos` (`comentario`, `created_at`, `nombre`, `updated_at`) VALUES ('da risa', '2015-04-26 04:52:11', 'comedia', '2015-04-26 04:52:11')
---
  def create
    @genero = Genero.new(genero_params)

    respond_to do |format|
      if @genero.save

UPDATE `generos` SET `comentario` = 'fvgbhnjkml', `updated_at` = '2015-04-27 17:51:21' WHERE `generos`.`id` = 2
---
  def update
    respond_to do |format|
      if @genero.update(genero_params)

DELETE FROM `generos` WHERE `generos`.`id` = 1
---
  def destroy
    @genero.destroy

SELECT  `generos`.* FROM `generos`  WHERE `generos`.`id` = 1 LIMIT 1
---
    def set_genero
      @genero = Genero.find(params[:id])