app/controllers/tipo_tickets_controller.rb

  def index
    @tipo_tickets = TipoTicket.all
---
SELECT `tipo_tickets`.* FROM `tipo_tickets`

  def create
    @tipo_ticket = TipoTicket.new(tipo_ticket_params)

    respond_to do |format|
      if @tipo_ticket.save
---
INSERT INTO `tipo_tickets` (`comentario`, `created_at`, `precio`, `tipo`, `updated_at`) VALUES ('hjfbsjvbfjsgsjfdkjgbfdgbfdm', '2015-05-01 17:04:08', 500.0, 'Adultos', '2015-05-01 17:04:08')

  def update
    respond_to do |format|
      if @tipo_ticket.update(tipo_ticket_params)
---
UPDATE `tipo_tickets` SET `precio` = 0.0, `updated_at` = '2015-05-02 17:01:40' WHERE `tipo_tickets`.`id` = 1

  def destroy
    @tipo_ticket.destroy
---
DELETE FROM `tipo_tickets` WHERE `tipo_tickets`.`id` = 1

    def set_tipo_ticket
      @tipo_ticket = TipoTicket.find(params[:id])
---
SELECT  `tipo_tickets`.* FROM `tipo_tickets`  WHERE `tipo_tickets`.`id` = 1 LIMIT 1